Repository: hutoczky/FormatX
Catalog: Resources/Strings.*.resx
Languages: hu

# menu.format
source: Format
hu: Formázás

# menu.drives
source: Disk health
hu: Lemez egészség

# menu.erase
source: Secure erase
hu: Biztonságos törlés

# menu.settings
source: Settings
hu: Beállítások

# title.app
source: FormatX Pro | Version: 2.0
hu: FormatX Pro | Verzió: 2.0

# status.ready
source: Idle
hu: Készenlét

# common.apply
source: Apply
hu: Alkalmaz

# common.validate
source: Validate
hu: Érvényesítés

# common.browse
source: Browse
hu: Tallózás

# common.exportCsv
source: Export log (CSV)
hu: Napló export (CSV)

# settings.language
source: Language
hu: Nyelv

# settings.theme
source: Theme
hu: Téma

# settings.theme.default
source: System (Default)
hu: Rendszer (Alapértelmezett)

# settings.background
source: Background (JPG/PNG/BMP)
hu: Háttérkép (JPG/PNG/BMP)

# settings.bg.hint
source: Choose a built-in image or your own file.
hu: Válassz beépített képet vagy saját fájlt.

# settings.about
source: About
hu: Névjegy

# settings.version
source: Version: 2.0
hu: Verzió: 2.0

# iso.placeholder
source: Select ISO
hu: Válassz ISO-t

# title.format
source: Format
hu: Formázás

# title.drives
source: Disk health
hu: Lemez állapot

# title.erase
source: Secure erase
hu: Biztonságos törlés

# title.settings
source: Settings
hu: Beállítások

# ui.format.drive
source: Drive
hu: Meghajtó

# ui.format.fs
source: File system
hu: Fájlrendszer

# ui.format.label
source: Label
hu: Címke

# ui.format.quick
source: Quick format
hu: Gyors formázás

# ui.format.start
source: Start format
hu: Formázás indítása

# ui.settings.pickbg
source: Select background...
hu: Háttér kiválasztása…

# ISO_Select
source: Select ISO
hu: ISO kiválasztása

# ISO_Browse
source: Browse
hu: Tallózás

# USB_Target
source: Target drive (removable)
hu: Cél meghajtó (eltávolítható)

# USB_Refresh
source: Refresh
hu: Frissítés

# USB_Write
source: Write ISO
hu: ISO írás

# USB_Verify
source: Verify USB
hu: USB ellenőrzés

# USB_Scheme
source: Partition scheme (GPT/MBR)
hu: Partíciós séma (GPT/MBR)

# USB_WriteScheme
source: Write scheme
hu: Írási séma

# DiskHealth_Bytes
source: Bytes to scan
hu: Ellenőrzendő bájtok (pl. 1073741824)

# DiskHealth_Bytes_Placeholder
source: Bytes to scan (e.g., 1073741824)
hu: Ellenőrzendő bájtok (pl. 1073741824)

# DiskHealth_Surface
source: Surface scan
hu: Felületi vizsgálat

# DiskHealth_SMART
source: SMART quick query
hu: SMART gyors lekérdezés

# HealthStatus_Good
source: Status: Good
hu: Állapot: Jó

# HealthStatus_Bad
source: Status: Bad
hu: Állapot: Rossz

# HealthStatus_Warn
source: Status: Warning
hu: Állapot: Figyelmeztetés

# HealthStatus_Unknown
source: Status: Unknown
hu: Állapot: Ismeretlen

# Btn_Start
source: Start
hu: Indítás

# Btn_BackDrives
source: Back to drives
hu: Meghajtókhoz

# Btn_SelectDrive
source: Select drive
hu: Meghajtó kiválasztása

# Btn_Exit
source: Exit
hu: Kilépés

# SecureErase_1Pass
source: 1 pass
hu: 1 átírás

# SecureErase_2Pass
source: 2 passes
hu: 2 átírás

# SecureErase_3Pass
source: 3 passes
hu: 3 átírás

# SecureErase_1
source: 1 pass
hu: 1 átírás

# SecureErase_2
source: 2 passes
hu: 2 átírás

# SecureErase_3
source: 3 passes
hu: 3 átírás

# Tooltip_GenericAction
source: Click to start the action
hu: Kattintás a művelet elindításához

# Tooltip_FileBrowse
source: Browse for a local ISO file
hu: Tallózz helyi ISO fájlhoz

# Tooltip_SelectDrive
source: Select a drive from the list for the operation
hu: Válassz meghajtót a listából a művelethez

# Helper_USB_Scheme
source: Select the partition scheme (GPT/MBR) for compatibility.
hu: Válaszd ki a partíciós sémát (GPT/MBR) a kompatibilitáshoz.

# Helper_TargetDrive
source: For safety, select only a removable target drive.
hu: Csak eltávolítható cél meghajtót válassz a biztonság érdekében.

# Helper_ISO_Select
source: Choose an ISO disk image from your local drive.
hu: Válassz egy ISO lemezképfájlt a helyi meghajtóról.

# Pro_Onboarding_Title
source: Why upgrade to Pro?
hu: Miért éri meg a Pro?

# Pro_Onboarding_Bullet1
source: Detailed SMART reports and reliable writes
hu: Részletes SMART riportok és megbízható írás

# Pro_Onboarding_Bullet2
source: Multiple overwrite modes and secure erase
hu: Több átírási mód és biztonságos törlés

# Pro_Onboarding_Bullet3
source: Audited logging and enterprise support
hu: Auditált naplózás és vállalati támogatás

# Pro_Onboarding_CTA
source: See Pro features
hu: Tovább a Pro funkciókra

# Tooltip_SurfaceScan
source: Search for surface errors
hu: Lemez felületi hibáinak keresése

# Tooltip_SMARTQuery
source: Get drive SMART status
hu: Meghajtó SMART állapotának lekérése

# ui.health.bytesToScan
source: Bytes to scan
hu: Ellenőrzendő bájtok (pl. 1073741824)

# ui.health.surfaceScan
source: Surface scan
hu: Felületi vizsgálat

# ui.health.smartQuick
source: SMART quick query
hu: SMART gyors lekérdezés

# ui.health.status.good
source: Status: Good
hu: Állapot: Jó

# ui.health.status.unknown
source: Status: Unknown
hu: Állapot: Ismeretlen

# ui.health.details
source: Details
hu: Részletek

# ui.health.drive.header
source: Drive to scan
hu: Vizsgálandó lemez

# ui.secure.target
source: Target disk
hu: Célmeghajtó

# ui.secure.fullFormat
source: Full format (slower)
hu: Teljes formázás (lassabb)

# ui.secure.pass1
source: 1 pass
hu: 1 menet (egyszeres felülírás)

# ui.secure.pass2
source: 2 passes
hu: 2 menet (kétszeres felülírás)

# ui.secure.pass3
source: 3 passes
hu: 3 menet (háromszoros felülírás)

# common.exit
source: Exit
hu: Kilépés

# common.selectdrive
source: Select a drive
hu: Meghajtó kiválasztása

# status.drives.refreshed
source: Drives refreshed
hu: Meghajtók frissítve

# status.refresh.skipped.energysaver
source: Energy Saver - refresh skipped
hu: Energiatakarékos mód – frissítés kihagyva

# dialog.confirm.title
source: Confirmation
hu: Megerősítés

# dialog.confirm.content
source: Are you sure you want to proceed?
hu: Biztosan végrehajtja a műveletet?

# dialog.confirm.yes
source: Yes
hu: Igen

# dialog.confirm.no
source: Cancel
hu: Mégse

# systemdrive.blocked
source: Selected drive is a system drive (disabled).
hu: A kijelölt meghajtó rendszermeghajtó (tiltva).

# partitions.apply.done
source: Partition plan applied
hu: Partíciós terv alkalmazva

# partitions.rollback.applied
source: Rollback applied
hu: Visszaállítás végrehajtva

# partitions.rollback.none
source: No rollback snapshot
hu: Nincs visszaállítási mentés

# operation.format.done
source: Format done
hu: Formázás kész

# operation.erase.done
source: Erase done
hu: Törlés kész

# background.set.success
source: Background set
hu: Háttér beállítva

# background.set.cancel
source: Background canceled
hu: Háttér visszavonva

# background.set.error
source: Failed to set background
hu: Háttér beállítása sikertelen

# s.mode.block
source: This feature requires full desktop capabilities and is unavailable in S-mode.
hu: Ez a funkció S-módban nem érhető el.

# Footer_Tagline
source: FormatX Pro — professional drive management
hu: FormatX Pro — professzionális meghajtókezelés

# part.current
source: Current partitions
hu: Jelenlegi partíciók

# part.planned
source: Planned partitions
hu: Tervezett partíciók

# part.diskNumber
source: Disk number
hu: Lemez sorszáma

# part.scheme
source: Partition scheme
hu: Partíciós séma

# part.load
source: Load partitions
hu: Partíciók betöltése

# part.apply
source: Apply changes
hu: Módosítások alkalmazása

# part.rollback
source: Rollback
hu: Visszaállítás

# settings.theme.hint
source: Default: follows system setting.
hu: Alapértelmezett: a rendszer beállítását követi.

# settings.licenseTelemetry
source: License and Telemetry
hu: Licenc és Telemetria

# license.placeholder
source: Enter license key
hu: Licenckulcs megadása

# license.activate.online
source: Activate (online)
hu: Aktiválás (online)

# license.activate.offline
source: Activate (offline)
hu: Aktiválás (offline)

# telemetry.label
source: Enable telemetry (usage data for development)
hu: Telemetria engedélyezése (adatgyűjtés a fejlesztéshez)

# installer.section
source: Installer
hu: Telepítő

# installer.buildMsix
source: Build MSIX installer
hu: MSIX telepítő készítése

# live.log.title
source: Live log (usb.*)
hu: Élő napló (usb.*)

# common.done
source: Done
hu: Kész

# iso.write.prepared
source: ISO → USB prepared
hu: ISO → USB előkészítve
